Tekla.Structures.DrawingInternal.dotEnumerator_t
DO NOT USE! For internal usage only!///

Tekla.Structures.DrawingInternal.dotEnumerator_t.MoreObjectsLeft


Tekla.Structures.DrawingInternal.dotEnumerator_t.nObjects


Tekla.Structures.DrawingInternal.dotEnumerator_t.Filter


Tekla.Structures.DrawingInternal.dotEnumerator_t.SubFilter
Enumerator subtype

Tekla.Structures.DrawingInternal.dotEnumerator_t.nObjectToStart


Tekla.Structures.DrawingInternal.dotEnumerator_t.aObjectIDs


Tekla.Structures.DrawingInternal.dotEnumerator_t.aObjectTypes


Tekla.Structures.DrawingInternal.dotEnumerator_t.FatherId
For example for getting children info

Tekla.Structures.DrawingInternal.dotEnumerator_t.DrawingId
DO NOT USE! For internal usage only!

Tekla.Structures.DrawingInternal.dotEnumerator_t.ModelObjectId


Tekla.Structures.DrawingInternal.dotEnumerator_t.aFilterName
Name of the select filter to apply

Tekla.Structures.DrawingInternal.dotEnumerator_t.ClientId
DO NOT USE! For internal usage only!

Tekla.Structures.DrawingInternal.dotEnumerator_t.#ctor(Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorTypeEnum,Tekla.Structures.Drawing.DrawingEnumeratorBase.EnumeratorSubTypeEnum)
DO NOT USE! For internal usage only!